---
kind: property
id: P:Autodesk.Revit.DB.Visual.Wave.WaveColor2
source: html/306618d7-942f-3b2c-4b1d-a61dd5a2acbe.htm
---
# Autodesk.Revit.DB.Visual.Wave.WaveColor2 Property

The property labeled "Color 2" from the "Wave" schema.

## Syntax (C#)
```csharp
public static string WaveColor2 { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.